<?php
//商品個数のselect用
foreach (range(1, 10) as $number) {
	$quantity[$number] = $number;
}

return [

	/*
	|--------------------------------------------------------------------------
	| site_name
	|--------------------------------------------------------------------------
	|
	| ??????
	|
	*/

	'site_name' => 'テストECサイト',

	/*
	|--------------------------------------------------------------------------
	| site_path
	|--------------------------------------------------------------------------
	|
	| ??????
	|
	*/

	'noimg_path' => '/img/noimg.jpg',
	'file_path' => 'public/',
	'thumbnail_path' => 'public/thumbnail/',
	'storage_path' => '/storage/',
	'storage_thumbnail_path' => '/storage/thumbnail/',

	/*
	|--------------------------------------------------------------------------
	| 配列関連
	|--------------------------------------------------------------------------
	|
	|
	// usersで使う定数
    'Users' => [
        'GENDER_NONE' => 0,
        'GENDER_MAN' => 1,
        'GENDER_WOMAN' => 2,
        'GENDER_LIST' => [
            'gender_none' => 0,
            'gender_man' => 1,
            'gender_woman' => 2,
        ],
    ],
	|
	*/
	//商品個数のselect用
	'quantity' => $quantity,

	'pref' => [
		"" => '選択下さい。',
		1 => '北海道',
		2 => '青森県',
		3 => '岩手県',
		4 => '宮城県',
		5 => '秋田県',
		6 => '山形県',
		7 => '福島県',
		8 => '茨城県',
		9 => '栃木県',
		10 => '群馬県',
		11 => '埼玉県',
		12 => '千葉県',
		13 => '東京都',
		14 => '神奈川県',
		15 => '山梨県',
		16 => '長野県',
		17 => '新潟県',
		18 => '富山県',
		19 => '石川県',
		20 => '福井県',
		21 => '岐阜県',
		22 => '静岡県',
		23 => '愛知県',
		24 => '三重県',
		25 => '滋賀県',
		26 => '京都府',
		27 => '大阪府',
		28 => '兵庫県',
		29 => '奈良県',
		30 => '和歌山県',
		31 => '鳥取県',
		32 => '島根県',
		33 => '岡山県',
		34 => '広島県',
		35 => '山口県',
		36 => '徳島県',
		37 => '香川県',
		38 => '愛媛県',
		39 => '高知県',
		40 => '福岡県',
		41 => '佐賀県',
		42 => '長崎県',
		43 => '熊本県',
		44 => '大分県',
		45 => '宮崎県',
		46 => '鹿児島県',
		47 => '沖縄県'
	],

	//-------------------------------------
	'payway' => [
		'collect_on_delivery' => '代引き',
		'credit_card' => 'クレジットカード',
	],
	'PAYWAY_DELIVERY' => 'collect_on_delivery',
	'PAYWAY_CARD' => 'credit_card',

	//-------------------------------------
	'status' => [
		1 => '公開',
		0 => '非公開',
	],
	'STATUS_ON' => 1,
	'STATUS_OFF' => 0,

	//-------------------------------------
	'role' => [
		1 => '管理者',
		2 => 'スタッフ',
	],
	'ROLE_ADMIN' => 1,
	'ROLE_STAFF' => 2,

	//-------------------------------------
	'action' => [
		1 => '登録',
		2 => '更新',
	],

	'admin_side_nav' => [
		'site' => [
			'ja' => 'サイト',
			'role' => '1',
			'link' => [
				'top' => '/admin/',
			]
		],
		'staff' => [
			'ja' => 'スタッフ管理',
			'role' => '1',
			'link' => [
				'一覧' => '/admin/staff/',
				'追加' => '/admin/staff/edit/'
			]
		],
		'product' => [
			'ja' => '商品',
			'link' => [
				'一覧' => '/admin/product/',
				'編集' => '/admin/product/edit/'
			]
		],
		'category' => [
			'ja' => 'カテゴリ',
			'link' => [
				'一覧' => '/admin/category/',
				'編集' => '/admin/category/edit/',
			]
		],
	],
];
